// 참고.cpp

// C++ 잘 하려면

// 1. C 언어 자체 잘해야 합니다.
// => 포인터, 배열, 함수등은 C로 마스터 해야 합니다.


// 2. C++ 기본 문법 학습 하세요
// => 1일차 같은 class 문법이 아닌 것들.!!
// => 2일차 같은 class 문법들..
// => Date 같은 기본 클래스 작성을 충실하게 ...


// 3. 객체지향 디자인을 어느 정도 학습하세요
// => GoF's 디자인 패턴
// => C++ IDioms


// => 예전에는 임베디드에서 "객체지향 디자인"을 사용하지 않았지만
// => 요즘은 아주 널리 사용.


// 4. STL 도 많이 알면 좋은데..
// => 임베디드에서 "금지" 항목이 많이 있으므로...
// => 필요한것 하던가. 아니면 전부 아는데, 사용하지 말던가
//--------------------------------------

// 복습하시다가 질문 사항은

// smkang @ codenuri.co.kr 
// 
// 로 보내 주세요

// git 에 있는 소스는 "1주일뒤 삭제 됩니다."
// 필요하신 분은 그전에 받아 두세요